Revit 2027 API
BuiltInFailures.StairRampFailures.StairsInMultistoryExceedTopConstraint Property
 Stairs in MultistoryStairs after adjusting still exceed the top constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsInMultistoryExceedTopConstraint { get; }
Public Shared ReadOnly Property StairsInMultistoryExceedTopConstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsInMultistoryExceedTopConstraint {
	FailureDefinitionId^ get ();
}
static member StairsInMultistoryExceedTopConstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace